/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50617
Source Host           : localhost:3306
Source Database       : stu_class

Target Server Type    : MYSQL
Target Server Version : 50617
File Encoding         : 65001

Date: 2016-05-28 18:09:26
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for all_course
-- ----------------------------
DROP TABLE IF EXISTS `all_course`;
CREATE TABLE `all_course` (
  `course_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `cid` int(4) NOT NULL AUTO_INCREMENT,
  `course_id` varchar(6) DEFAULT NULL,
  `course_teacher` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_room` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_type` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_keep` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_state` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_check` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB AUTO_INCREMENT=250 DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of all_course
-- ----------------------------
INSERT INTO `all_course` VALUES ('素描与色彩', '155', '120732', null, '美术教室8231', '集中实践', '9周', '选课状态:正常', '120732美术教室8231集中实践9周选课状态:正常');
INSERT INTO `all_course` VALUES ('大学英语2', '156', '050142', '(视听说)', '师嘉林', '4207', '必修', '1-17周', '050142(视听说)师嘉林4207必修');
INSERT INTO `all_course` VALUES ('数字电路实验', '157', '011123', null, '电子电路实验室（二）S213', '实践环节', '11周', '选课状态:指导', '011123电子电路实验室（二）S213实践环节11周选课状态:指导');
INSERT INTO `all_course` VALUES ('数字电路实验', '158', '011123', null, '电子电路实验室（二）S213', '实践环节', '12周', '选课状态:指导', '011123电子电路实验室（二）S213实践环节12周选课状态:指导');
INSERT INTO `all_course` VALUES ('数字电路实验', '159', '011123', null, '电子电路实验室（二）S213', '实践环节', '13周', '选课状态:指导', '011123电子电路实验室（二）S213实践环节13周选课状态:指导');
INSERT INTO `all_course` VALUES ('数字电路实验', '160', '011123', null, '电子电路实验室（二）S213', '实践环节', '14周', '选课状态:指导', '011123电子电路实验室（二）S213实践环节14周选课状态:指导');
INSERT INTO `all_course` VALUES ('大学物理(上)', '161', '020117', '罗小兵', '3108', '必修', '1-17周', '选课状态:正常', '020117罗小兵3108必修1-17周');
INSERT INTO `all_course` VALUES ('数据结构与算法', '162', '040783', '雷大江', '4304', '必修', '1-17周', '选课状态:正常', '040783雷大江4304必修1-17周');
INSERT INTO `all_course` VALUES ('素描与色彩', '163', '120732', null, '美术教室8231', '集中实践', '8周', '选课状态:正常', '120732美术教室8231集中实践8周选课状态:正常');
INSERT INTO `all_course` VALUES ('', '164', '???', '', '', '', '', '', '三四节');
INSERT INTO `all_course` VALUES ('高等数学(下)', '165', '040402', '耿金玲', '3201', '必修', '1-16周', '选课状态:正常', '040402耿金玲3201必修1-16周');
INSERT INTO `all_course` VALUES ('形势与政策', '166', '070107', '户可英', '3108', '必修', '7-11周', '选课状态:正常', '070107户可英3108必修7-11周');
INSERT INTO `all_course` VALUES ('数字电路与逻辑设计', '167', '010131', '周冬生', '3111', '必修', '1-15周', '选课状态:正常', '010131周冬生3111必修1-15周');
INSERT INTO `all_course` VALUES ('西方哲学述评', '168', '070253', '王莉', '2410', '任选', '1-8周', '选课状态:正常', '070253王莉2410任选1-8周');
INSERT INTO `all_course` VALUES ('高等数学(下)', '169', '040402', '耿金玲', '3506', '必修', '1-16周', '选课状态:正常', '040402耿金玲3506必修1-16周');
INSERT INTO `all_course` VALUES ('随机数学', '170', '110637', '吴寿章', '2416', '必修', '1-15周', '选课状态:正常', '110637吴寿章2416必修1-15周');
INSERT INTO `all_course` VALUES ('物理实验(上)', '171', '021107', null, '物理实验室S104', '独立实验(实践)', '3周', '选课状态:正常', '021107物理实验室S104独立实验(实践)3周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '172', '021107', null, '物理实验室S104', '独立实验(实践)', '4周', '选课状态:正常', '021107物理实验室S104独立实验(实践)4周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '173', '021107', null, '物理实验室S116', '独立实验(实践)', '5周', '选课状态:正常', '021107物理实验室S116独立实验(实践)5周选课状态:正常');
INSERT INTO `all_course` VALUES ('大学英语2', '174', '050143', '(读写译)', '师嘉林', '4207', '必修', '1-17周', '050143(读写译)师嘉林4207必修');
INSERT INTO `all_course` VALUES ('', '175', '', '', '', '', '', '', '');
INSERT INTO `all_course` VALUES ('数据结构与算法', '176', '040783', null, '计算软件实验室S331', '随课实验', '4-6周', '10-14周', '040783计算软件实验室S331随课实验4-6周10-14周');
INSERT INTO `all_course` VALUES ('', '177', '????:?', null, '', '', '', '', '选课状态:正常');
INSERT INTO `all_course` VALUES ('体育（2', '178', '090110', '）乒乓球一班', '教师1', '运动场', '必修', '1-17周', '090110）乒乓球一班教师1运动场必修');
INSERT INTO `all_course` VALUES ('大学物理(上)', '179', '020117', '罗小兵', '3108', '必修', '双周', '选课状态:正常', '020117罗小兵3108必修双周');
INSERT INTO `all_course` VALUES ('120732', '180', '????:?', '素描与色彩', '美术教室8231', '集中实践', '9周', '选课状态:正常', '选课状态:正常120732素描与色彩美术教室8231集中实践');
INSERT INTO `all_course` VALUES ('素描与色彩', '181', '120732', '美术教室8231', '集中实践', '9周', '选课状态:正常', '', '120732素描与色彩美术教室8231集中实践9周');
INSERT INTO `all_course` VALUES ('数字电路实验', '182', '011123', null, '电子电路实验室（二）S213', '独立实验(实践)', '11周', '选课状态:正常', '011123电子电路实验室（二）S213独立实验(实践)11周选课状态:正常');
INSERT INTO `all_course` VALUES ('数字电路实验', '183', '011123', null, '电子电路实验室（二）S213', '独立实验(实践)', '12周', '选课状态:正常', '011123电子电路实验室（二）S213独立实验(实践)12周选课状态:正常');
INSERT INTO `all_course` VALUES ('数字电路实验', '184', '011123', null, '电子电路实验室（二）S213', '独立实验(实践)', '13周', '选课状态:正常', '011123电子电路实验室（二）S213独立实验(实践)13周选课状态:正常');
INSERT INTO `all_course` VALUES ('数字电路实验', '185', '011123', null, '电子电路实验室（二）S213', '独立实验(实践)', '14周', '选课状态:正常', '011123电子电路实验室（二）S213独立实验(实践)14周选课状态:正常');
INSERT INTO `all_course` VALUES ('体育（2', '186', '090110', '）啦啦操一班', '教师1', '运动场', '必修', '1-17周', '090110）啦啦操一班教师1运动场必修');
INSERT INTO `all_course` VALUES ('大学英语3', '187', '050144', '(视听说)', '姜敬', '4208', '必修', '1-17周', '050144(视听说)姜敬4208必修');
INSERT INTO `all_course` VALUES ('大学英语3', '188', '050145', '(读写译)', '姜敬', '4208', '必修', '1-17周', '050145(读写译)姜敬4208必修');
INSERT INTO `all_course` VALUES ('女子防身术', '189', '090021', '涂佳', '跆拳道馆', '任选', '1-16周', '选课状态:正常', '090021涂佳跆拳道馆任选1-16周');
INSERT INTO `all_course` VALUES ('体育（2', '190', '090110', '）网球', '教师1', '运动场', '必修', '1-17周', '090110）网球教师1运动场必修');
INSERT INTO `all_course` VALUES ('现当代文学鉴赏', '191', '121131', '张梦婕', '3104', '任选', '1-8周', '选课状态:正常', '121131张梦婕3104任选1-8周');
INSERT INTO `all_course` VALUES ('中西诗学比较研究（Mooc', '192', 'Mooc13', '）', '陶永莉', '2117', '任选', '2、9', 'Mooc13中西诗学比较研究（Mooc）陶永莉2117');
INSERT INTO `all_course` VALUES ('选课状态:正常', '193', '?', '120732', '素描与色彩', '美术教室8231', '集中实践', '9周', '周120732素描与色彩美术教室8231集中实践');
INSERT INTO `all_course` VALUES ('体育（2', '194', '090110', '）武术', '教师1', '运动场', '必修', '1-17周', '090110）武术教师1运动场必修');
INSERT INTO `all_course` VALUES ('素描与色彩', '195', '120732', null, '美术教室8232', '集中实践', '9周', '选课状态:正常', '120732美术教室8232集中实践9周选课状态:正常');
INSERT INTO `all_course` VALUES ('120732', '196', '????:?', '素描与色彩', '美术教室8232', '集中实践', '9周', '选课状态:正常', '选课状态:正常120732素描与色彩美术教室8232集中实践');
INSERT INTO `all_course` VALUES ('素描与色彩', '197', '120732', null, '美术教室8232', '集中实践', '8周', '选课状态:正常', '120732美术教室8232集中实践8周选课状态:正常');
INSERT INTO `all_course` VALUES ('素描与色彩', '198', '120732', '美术教室8232', '集中实践', '9周', '选课状态:正常', '', '120732素描与色彩美术教室8232集中实践9周');
INSERT INTO `all_course` VALUES ('物理实验(上)', '199', '021107', null, '物理实验室S113', '独立实验(实践)', '4周', '选课状态:正常', '021107物理实验室S113独立实验(实践)4周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '200', '021107', null, '物理实验室S104', '独立实验(实践)', '5周', '选课状态:正常', '021107物理实验室S104独立实验(实践)5周选课状态:正常');
INSERT INTO `all_course` VALUES ('体育（2', '201', '090110', '）足球三班', '教师1', '运动场', '必修', '1-17周', '090110）足球三班教师1运动场必修');
INSERT INTO `all_course` VALUES ('体育（2', '202', '090110', '）飞盘', '教师1', '运动场', '必修', '1-17周', '090110）飞盘教师1运动场必修');
INSERT INTO `all_course` VALUES ('网络与经济', '203', '031416', '高孝平', '2116', '任选', '1-8周', '选课状态:正常', '031416高孝平2116任选1-8周');
INSERT INTO `all_course` VALUES ('工科数学分析(下)', '204', '040428', '张蓉', '3101', '限选', '1-15周', '选课状态:正常', '040428张蓉3101限选1-15周');
INSERT INTO `all_course` VALUES ('体育（2', '205', '090110', '）足球一班', '教师1', '运动场', '必修', '1-17周', '090110）足球一班教师1运动场必修');
INSERT INTO `all_course` VALUES ('体育（2', '206', '090110', '）足球二班', '教师1', '运动场', '必修', '1-17周', '090110）足球二班教师1运动场必修');
INSERT INTO `all_course` VALUES ('物理实验(上)', '207', '021107', null, '物理实验室S116', '独立实验(实践)', '6周', '选课状态:正常', '021107物理实验室S116独立实验(实践)6周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '208', '021107', null, '物理实验室S116', '独立实验(实践)', '10周', '选课状态:正常', '021107物理实验室S116独立实验(实践)10周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '209', '021107', null, '物理实验室S117', '独立实验(实践)', '15周', '选课状态:正常', '021107物理实验室S117独立实验(实践)15周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '210', '021107', null, '物理实验室S113', '独立实验(实践)', '16周', '选课状态:正常', '021107物理实验室S113独立实验(实践)16周选课状态:正常');
INSERT INTO `all_course` VALUES ('知识产权经典案例评析', '211', '070061', '吴映颖', '3508', '任选', '1-8周', '选课状态:正常', '070061吴映颖3508任选1-8周');
INSERT INTO `all_course` VALUES ('', '212', '??????', '', '', '', '', '', '数字电路实验');
INSERT INTO `all_course` VALUES ('', '213', '??', '', '', '', '', '', '实践');
INSERT INTO `all_course` VALUES ('', '214', '????(?', '', '', '', '', '', '独立实验(实践)');
INSERT INTO `all_course` VALUES ('', '215', '??', '', '', '', '', '', '正常');
INSERT INTO `all_course` VALUES ('体育（2', '216', '090110', '）乒乓球三班', '教师1', '运动场', '必修', '1-17周', '090110）乒乓球三班教师1运动场必修');
INSERT INTO `all_course` VALUES ('体育（2', '217', '090110', '）篮球二班', '教师1', '运动场', '必修', '1-17周', '090110）篮球二班教师1运动场必修');
INSERT INTO `all_course` VALUES ('大学英语2', '218', '050142', '(视听说)', '雷芳(外)', '4204', '必修', '1-17周', '050142(视听说)雷芳(外)4204必修');
INSERT INTO `all_course` VALUES ('大学英语2', '219', '050143', '(读写译)', '雷芳(外)', '4204', '必修', '1-17周', '050143(读写译)雷芳(外)4204必修');
INSERT INTO `all_course` VALUES ('体育（2', '220', '090110', '）排球一班', '教师1', '运动场', '必修', '1-17周', '090110）排球一班教师1运动场必修');
INSERT INTO `all_course` VALUES ('魅力高效沟通实战技巧（Mooc', '221', 'Mooc16', '）', '贾莹', '2117', '任选', '9周', 'Mooc16）贾莹2117任选');
INSERT INTO `all_course` VALUES ('情绪管理（Mooc', '222', 'Mooc06', '）', '陈敏', '2117', '任选', '9周', 'Mooc06）陈敏2117任选');
INSERT INTO `all_course` VALUES ('体育（2', '223', '090110', '）啦啦操二班', '教师1', '运动场', '必修', '1-17周', '090110）啦啦操二班教师1运动场必修');
INSERT INTO `all_course` VALUES ('CT原理及其临床应用', '224', '060016', '李章勇', '3301', '任选', '1-8周', '选课状态:正常', '060016李章勇3301任选1-8周');
INSERT INTO `all_course` VALUES ('大学生审美修养', '225', '121118', '肖雪梅', '2416', '任选', '9-16周', '选课状态:正常', '121118肖雪梅2416任选9-16周');
INSERT INTO `all_course` VALUES ('网络与经济', '226', '031416', '钟山', '2215', '任选', '1-8周', '选课状态:正常', '031416钟山2215任选1-8周');
INSERT INTO `all_course` VALUES ('花卉栽培与养生保健', '227', '060069', '向浏欣', '2101', '任选', '1-16周', '选课状态:正常', '060069向浏欣2101任选1-16周');
INSERT INTO `all_course` VALUES ('电子证据', '228', '070062', '畅君元', '3508', '任选', '9-10周', '选课状态:正常', '070062电子证据畅君元3508任选');
INSERT INTO `all_course` VALUES ('人生与理财', '229', '031303', '刘芬', '3405', '任选', '1-8周', '选课状态:正常', '031303刘芬3405任选1-8周');
INSERT INTO `all_course` VALUES ('电子证据', '230', '070062', '畅君元', '2116', '任选', '9-10周', '选课状态:正常', '070062畅君元2116任选9-10周');
INSERT INTO `all_course` VALUES ('素描与色彩', '231', '120732', null, '美术教室8233', '集中实践', '9周', '选课状态:正常', '120732美术教室8233集中实践9周选课状态:正常');
INSERT INTO `all_course` VALUES ('120732', '232', '????:?', '素描与色彩', '美术教室8233', '集中实践', '9周', '选课状态:正常', '选课状态:正常120732素描与色彩美术教室8233集中实践');
INSERT INTO `all_course` VALUES ('数据结构与算法', '233', '040783', '张璞', '4305', '必修', '1-17周', '选课状态:正常', '040783张璞4305必修1-17周');
INSERT INTO `all_course` VALUES ('素描与色彩', '234', '120732', null, '美术教室8233', '集中实践', '8周', '选课状态:正常', '120732美术教室8233集中实践8周选课状态:正常');
INSERT INTO `all_course` VALUES ('素描与色彩', '235', '120732', '美术教室8233', '集中实践', '9周', '选课状态:正常', '', '120732素描与色彩美术教室8233集中实践9周');
INSERT INTO `all_course` VALUES ('物理实验(上)', '236', '021107', null, '物理实验室S116', '独立实验(实践)', '4周', '选课状态:正常', '021107物理实验室S116独立实验(实践)4周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '237', '021107', null, '物理实验室S113', '独立实验(实践)', '5周', '选课状态:正常', '021107物理实验室S113独立实验(实践)5周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '238', '021107', null, '物理实验室S104', '独立实验(实践)', '6周', '选课状态:正常', '021107物理实验室S104独立实验(实践)6周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '239', '021107', null, '物理实验室S113', '独立实验(实践)', '10周', '选课状态:正常', '021107物理实验室S113独立实验(实践)10周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '240', '021107', null, '物理实验室S104', '独立实验(实践)', '15周', '选课状态:正常', '021107物理实验室S104独立实验(实践)15周选课状态:正常');
INSERT INTO `all_course` VALUES ('物理实验(上)', '241', '021107', null, '物理实验室S117', '独立实验(实践)', '16周', '选课状态:正常', '021107物理实验室S117独立实验(实践)16周选课状态:正常');
INSERT INTO `all_course` VALUES ('数据结构与算法', '242', '040783', null, '计算软件实验室S331', '随课实验', '5-7周', '10-14周', '040783计算软件实验室S331随课实验5-7周10-14周');
INSERT INTO `all_course` VALUES ('120732', '243', '????:?', null, '素描与色彩', '美术教室8233', '集中实践', '9周', '选课状态:正常素描与色彩美术教室8233集中实践9周');
INSERT INTO `all_course` VALUES ('大学英语2', '244', '050142', '(视听说)', '邱珊', '4201', '必修', '1-17周', '050142(视听说)邱珊4201必修');
INSERT INTO `all_course` VALUES ('大学英语2', '245', '050142', '(视听说)', '刘存伟', '4202', '必修', '1-16周', '050142(视听说)刘存伟4202必修');
INSERT INTO `all_course` VALUES ('大学英语2', '246', '050143', '(读写译)', '谢巧', '4206', '必修', '1-17周', '050143(读写译)谢巧4206必修');
INSERT INTO `all_course` VALUES ('体育（2', '247', '090110', '）跆拳道', '教师1', '运动场', '必修', '1-17周', '090110）跆拳道教师1运动场必修');
INSERT INTO `all_course` VALUES ('公关心理学', '248', '030752', '刘芬', '3408', '任选', '1-8周', '选课状态:正常', '030752刘芬3408任选1-8周');
INSERT INTO `all_course` VALUES ('现当代文学鉴赏', '249', '121131', '张梦婕', '3104', '任选', '9-16周', '选课状态:正常', '121131现当代文学鉴赏张梦婕3104任选');

-- ----------------------------
-- Table structure for id_name
-- ----------------------------
DROP TABLE IF EXISTS `id_name`;
CREATE TABLE `id_name` (
  `course_id` int(6) NOT NULL,
  `course_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of id_name
-- ----------------------------

-- ----------------------------
-- Table structure for stu_chocie
-- ----------------------------
DROP TABLE IF EXISTS `stu_chocie`;
CREATE TABLE `stu_chocie` (
  `stu_id` int(10) NOT NULL,
  `cid` int(4) DEFAULT NULL,
  `course_week` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `course_number` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`stu_id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of stu_chocie
-- ----------------------------
